src/InformationRegisters/УведомленияПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УведомленияПользователей</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТекстУведомления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Прочитано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПрочтения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоказа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Обработано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОбработки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ITЗаявка</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипУведомления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыУведомлений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ТипыУведомлений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыУведомлений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НазначениеЗаявки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросУточнения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветНаУточнение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РешениеЗаявки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратВРаботу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НарушениеСрокаРеакции</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НарушениеСрокаРешения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НарушениеSLA</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетНазначения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетЗакрытия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяРаботаСОборудованием</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РаботаСОборудованиемЗавершена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/CommonModules/УправлениеУведомлениямиСервер/Ext/Module.bsl
Функция ЗаписатьУведомление(Получатель, Заявка, ТипУведомления, ТекстУведомления, МоментУведомления) Экспорт	
	Если НЕ ЗначениеЗаполнено(Получатель) Тогда
		Сообщить("Не указан получатель уведомления.");
		Возврат Ложь;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Заявка) Тогда
		Сообщить("Не указана заявка для уведомления.");
		Возврат Ложь;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ТипУведомления) Тогда
		Сообщить("Не указан тип уведомления.");
		Возврат Ложь;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ТекстУведомления) Тогда
		Сообщить("Не заполнен текст уведомления.");
		Возврат Ложь;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(МоментУведомления) Тогда
		Сообщить("Не указан момент создания уведомления.");
		Возврат Ложь;
	КонецЕсли;   
	
	Попытка
		ЗаписьУведомления = РегистрыСведений.УведомленияПользователей.СоздатьМенеджерЗаписи();
		ЗаписьУведомления.Период = МоментУведомления;
		ЗаписьУведомления.Получатель = Получатель;
		ЗаписьУведомления.Заявка = Заявка;
		ЗаписьУведомления.ТипУведомления = ТипУведомления;
		ЗаписьУведомления.ТекстУведомления = ТекстУведомления;
		ЗаписьУведомления.Прочитано = Ложь;
		ЗаписьУведомления.Обработано = Ложь;
		
		ЗаписьУведомления.Записать();
	Исключение
		Сообщить("Не удалось создать уведомление. " + ОписаниеОшибки());
	    Возврат Ложь;
	КонецПопытки; 
	Возврат Истина;
КонецФункции        

Функция ОтметитьУведомленияПоказанными(Уведомления) Экспорт
	ТекущийСотрудник = УправлениеПользователямиСервер.ПолучитьТекущегоСотрудника();
	Если ТекущийСотрудник = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	МоментПоказа = ТекущаяДатаСеанса();
	
	Попытка
	
		Для каждого Уведомление Из Уведомления Цикл 
				ЗаписьУведомления = РегистрыСведений.УведомленияПользователей.СоздатьМенеджерЗаписи();
				ЗаписьУведомления.Период = Уведомление.Период;
				ЗаписьУведомления.Получатель = ТекущийСотрудник;
				ЗаписьУведомления.Заявка = Уведомление.Заявка;
				ЗаписьУведомления.ТипУведомления = Уведомление.ТипУведомления;
				
				ЗаписьУведомления.Прочитать();
				Если ЗаписьУведомления.Выбран() И НЕ ЗначениеЗаполнено(ЗаписьУведомления.ДатаПоказа) Тогда
					ЗаписьУведомления.ДатаПоказа = МоментПоказа;	
					ЗаписьУведомления.Записать();	
				КонецЕсли; 
		КонецЦикла;
		
	Исключение  
		Сообщить("Не удалось отметить уведомления показанными. " + ОписаниеОшибки());
	    Возврат Ложь;
			
	КонецПопытки;
		
	Возврат Истина;
КонецФункции

Функция ЗаписатьУведомленияРуководителям(Заявка, ТипУведомления, ТекстУведомления, МоментУведомления) Экспорт
	Если НЕ ЗначениеЗаполнено(Заявка) Тогда
		Сообщить("Не указана заявка для уведомления.");
		Возврат Ложь;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ТипУведомления) Тогда
		Сообщить("Не указан тип уведомления.");
		Возврат Ложь;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ТекстУведомления) Тогда
		Сообщить("Не заполнен текст уведомления.");
		Возврат Ложь;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(МоментУведомления) Тогда
		Сообщить("Не указан момент создания уведомления.");
		Возврат Ложь;
	КонецЕсли;   
	
	Попытка
		РуководителиIT = УправлениеПользователямиСервер.ПолучитьРуководителейIT();	
	Исключение
	    Сообщить("Не удалось получить список руководителей IT. " + ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
				
	Если РуководителиIT.Количество() = 0 Тогда
		Сообщить("Не найден ни один активный руководитель IT.");
		Возврат Ложь;
	КонецЕсли;
	
	Для каждого Руководитель Из РуководителиIT Цикл
		УведомлениеЗаписано = ЗаписатьУведомление(Руководитель, Заявка, ТипУведомления, ТекстУведомления, МоментУведомления);
		Если НЕ УведомлениеЗаписано Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
КонецФункции        

Функция ЗаписатьУведомленияОтветственнымЗаОборудование(Заявка, ТипУведомления, ТекстУведомления, МоментУведомления) Экспорт

	Если НЕ ЗначениеЗаполнено(Заявка) Тогда
		Сообщить("Не указана заявка для уведомления.");
		Возврат Ложь;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ТипУведомления) Тогда
		Сообщить("Не указан тип уведомления.");
		Возврат Ложь;
	КонецЕсли;

	Если ПустаяСтрока(СокрЛП(ТекстУведомления)) Тогда
		Сообщить("Не заполнен текст уведомления.");
		Возврат Ложь;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(МоментУведомления) Тогда
		Сообщить("Не указан момент создания уведомления.");
		Возврат Ложь;
	КонецЕсли;

	Попытка
		Ответственные = УправлениеПользователямиСервер.ПолучитьОтветственныхЗаОборудование();

	Исключение
		Сообщить("Не удалось получить ответственных за оборудование. " + ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;

	Если Ответственные.Количество() = 0 Тогда
		Сообщить("Не найден ни один ответственный за оборудование.");
		Возврат Ложь;
	КонецЕсли;

	Для каждого Ответственный Из Ответственные Цикл
		УведомлениеЗаписано = ЗаписатьУведомление(Ответственный, Заявка, ТипУведомления, ТекстУведомления, МоментУведомления);
		Если НЕ УведомлениеЗаписано Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;

	Возврат Истина;
КонецФункции

Функция ОтметитьУведомленияОбработанными(Заявка, ТипУведомления, МоментОбработки) Экспорт     
	Если НЕ ЗначениеЗаполнено(Заявка) Тогда
		Сообщить("Не указана заявка для уведомления.");
		Возврат Ложь;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ТипУведомления) Тогда
		Сообщить("Не указан тип уведомления.");
		Возврат Ложь;
	КонецЕсли;      
	
	Если НЕ ЗначениеЗаполнено(МоментОбработки) Тогда
		Сообщить("Не указан момент обработки уведомлений.");
		Возврат Ложь;
	КонецЕсли;
	
	Попытка
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	УведомленияПользователей.Период КАК Период,
			|	УведомленияПользователей.Получатель КАК Получатель,
			|	УведомленияПользователей.Заявка КАК Заявка,
			|	УведомленияПользователей.ТипУведомления КАК ТипУведомления
			|ИЗ
			|	РегистрСведений.УведомленияПользователей КАК УведомленияПользователей
			|ГДЕ
			|	УведомленияПользователей.Заявка = &Заявка
			|	И УведомленияПользователей.ТипУведомления = &ТипУведомления
			|	И УведомленияПользователей.Обработано = ЛОЖЬ";
		
		Запрос.УстановитьПараметр("Заявка", Заявка);
		Запрос.УстановитьПараметр("ТипУведомления", ТипУведомления);
		
		ТаблицаУведомлений = Запрос.Выполнить().Выгрузить();

		Для каждого Уведомление Из ТаблицаУведомлений Цикл
		ЗаписьУведомлений = РегистрыСведений.УведомленияПользователей.СоздатьМенеджерЗаписи();
		ЗаписьУведомлений.Период = Уведомление.Период;
		ЗаписьУведомлений.Получатель = Уведомление.Получатель;
		ЗаписьУведомлений.Заявка = Уведомление.Заявка;
	    ЗаписьУведомлений.ТипУведомления = Уведомление.ТипУведомления;
		
		ЗаписьУведомлений.Прочитать();
		Если ЗаписьУведомлений.Выбран() И НЕ ЗаписьУведомлений.Обработано  Тогда
			ЗаписьУведомлений.Обработано = ИСТИНА;
			ЗаписьУведомлений.ДатаОбработки = МоментОбработки;
			ЗаписьУведомлений.Записать();
		КонецЕсли;
	КонецЦикла;
		
	Исключение
		Сообщить("Не удалось отметить уведомления обработанными. " + ОписаниеОшибки());
	    Возврат Ложь;
				
	КонецПопытки;
	
	Возврат Истина;
КонецФункции             

Функция ОтметитьУведомлениеПрочитанным(Период, Заявка, ТипУведомления) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Заявка) Тогда
		Сообщить("Не указана заявка для уведомления.");
		Возврат Ложь;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ТипУведомления) Тогда
		Сообщить("Не указан тип уведомления.");
		Возврат Ложь;
	КонецЕсли;      
	
	Если НЕ ЗначениеЗаполнено(Период) Тогда
		Сообщить("Не указан период уведомления.");
		Возврат Ложь;
	КонецЕсли;
	
	ТекущийСотрудник =
		УправлениеПользователямиСервер.ПолучитьТекущегоСотрудника();
		
	Если НЕ ЗначениеЗаполнено(ТекущийСотрудник) Тогда
		Сообщить("Не удалось определить текущего пользователя.");
		Возврат Ложь;
	КонецЕсли;
	
	Попытка
	
		ЗаписьУведомления = РегистрыСведений.УведомленияПользователей.СоздатьМенеджерЗаписи();		
		ЗаписьУведомления.Период = Период;
		ЗаписьУведомления.Получатель = ТекущийСотрудник;
		ЗаписьУведомления.Заявка = Заявка;
		ЗаписьУведомления.ТипУведомления = ТипУведомления;	
		
		ЗаписьУведомления.Прочитать();  
		
		Если НЕ ЗаписьУведомления.Выбран() Тогда
			Сообщить("Уведомление не найдено.");
			Возврат Ложь;
		КонецЕсли;
		
		Если НЕ ЗаписьУведомления.Прочитано Тогда
			ЗаписьУведомления.Прочитано = Истина;
			ЗаписьУведомления.ДатаПрочтения = ТекущаяДатаСеанса();
			ЗаписьУведомления.Записать();	
		КонецЕсли;
		
	Исключение
		Сообщить(
			"Не удалось отметить уведомление прочитанным. "
			+ ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

Функция ОбработатьУведомленияПриАннулированииОтвета(Заявка, МоментОтвета, МоментАннулирования) Экспорт
	Если НЕ ЗначениеЗаполнено(Заявка) Тогда
		Сообщить("Не указана заявка.");
		Возврат Ложь;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(МоментОтвета) Тогда
		Сообщить("Не указан момент создания ответа.");
		Возврат Ложь;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(МоментАннулирования) Тогда
		Сообщить("Не указан момент аннулирования ответа.");
		Возврат Ложь;
	КонецЕсли;
	
	Попытка
		ЗапросУточнений = Новый Запрос;
		ЗапросУточнений.Текст = 
			"ВЫБРАТЬ
			|	УведомленияПользователей.Период КАК Период,
			|	УведомленияПользователей.Получатель КАК Получатель,
			|	УведомленияПользователей.Заявка КАК Заявка,
			|	УведомленияПользователей.ТипУведомления КАК ТипУведомления
			|ИЗ
			|	РегистрСведений.УведомленияПользователей КАК УведомленияПользователей
			|ГДЕ
			|	УведомленияПользователей.Заявка = &Заявка
			|	И УведомленияПользователей.ТипУведомления = &ТипУведомления
			|	И УведомленияПользователей.Обработано = ИСТИНА
			|	И УведомленияПользователей.ДатаОбработки = &МоментОтвета";
		
		ЗапросУточнений.УстановитьПараметр("Заявка", Заявка);
		ЗапросУточнений.УстановитьПараметр("МоментОтвета", МоментОтвета);
		ЗапросУточнений.УстановитьПараметр("ТипУведомления", Перечисления.ТипыУведомлений.ЗапросУточнения);
		
		ТаблицаУточнений = ЗапросУточнений.Выполнить().Выгрузить();
		Для каждого Уведомление Из ТаблицаУточнений Цикл
			ЗаписьУведомления = РегистрыСведений.УведомленияПользователей.СоздатьМенеджерЗаписи();
			ЗаписьУведомления.Период = Уведомление.Период;
			ЗаписьУведомления.Получатель = Уведомление.Получатель;
			ЗаписьУведомления.Заявка = Уведомление.Заявка;
			ЗаписьУведомления.ТипУведомления = Уведомление.ТипУведомления;
			
			ЗаписьУведомления.Прочитать();
			Если ЗаписьУведомления.Выбран()
				И ЗаписьУведомления.Обработано
				И ЗаписьУведомления.ДатаОбработки = МоментОтвета Тогда
				
				ЗаписьУведомления.Обработано = Ложь;
				ЗаписьУведомления.ДатаОбработки = Дата(1, 1, 1);
				ЗаписьУведомления.Записать();   
			КонецЕсли;    
		КонецЦикла;    
		
		ЗапросОтветов = Новый Запрос;
		ЗапросОтветов.Текст = 
			"ВЫБРАТЬ
			|	УведомленияПользователей.Период КАК Период,
			|	УведомленияПользователей.Получатель КАК Получатель,
			|	УведомленияПользователей.Заявка КАК Заявка,
			|	УведомленияПользователей.ТипУведомления КАК ТипУведомления
			|ИЗ
			|	РегистрСведений.УведомленияПользователей КАК УведомленияПользователей
			|ГДЕ
			|	УведомленияПользователей.Заявка = &Заявка
			|	И УведомленияПользователей.ТипУведомления = &ТипУведомления  
			|	И УведомленияПользователей.Период = &МоментОтвета
			|	И УведомленияПользователей.Обработано = ЛОЖЬ";
		
		ЗапросОтветов.УстановитьПараметр("Заявка", Заявка);
		ЗапросОтветов.УстановитьПараметр("МоментОтвета", МоментОтвета);
		ЗапросОтветов.УстановитьПараметр("ТипУведомления", Перечисления.ТипыУведомлений.ОтветНаУточнение);
		
		ТаблицаОтветов = ЗапросОтветов.Выполнить().Выгрузить();
		Для каждого Уведомление Из ТаблицаОтветов Цикл
			ЗаписьУведомления = РегистрыСведений.УведомленияПользователей.СоздатьМенеджерЗаписи();
			ЗаписьУведомления.Период = Уведомление.Период;
			ЗаписьУведомления.Получатель = Уведомление.Получатель;
			ЗаписьУведомления.Заявка = Уведомление.Заявка;
			ЗаписьУведомления.ТипУведомления = Уведомление.ТипУведомления;
			
			ЗаписьУведомления.Прочитать();
			Если ЗаписьУведомления.Выбран() И НЕ ЗаписьУведомления.Обработано Тогда		
		    	ЗаписьУведомления.Обработано = Истина;
				ЗаписьУведомления.ДатаОбработки = МоментАннулирования;

				ЗаписьУведомления.Записать();

			КонецЕсли;
		КонецЦикла;
		
	Исключение
		Сообщить("Не удалось обработать уведомления при удалении ответа. " + ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	
    Возврат Истина;
КонецФункции    

Функция ОтметитьУведомленияПоЗаявкеПрочитанными(Заявка) Экспорт
	Если НЕ ЗначениеЗаполнено(Заявка) Тогда
		Сообщить("Не указана заявка.");
		Возврат Ложь;
	КонецЕсли;
	
	Попытка
		ТекущийСотрудник = УправлениеПользователямиСервер.ПолучитьТекущегоСотрудника();

	Исключение
	    Сообщить("Не удалось определить текущего сотрудника. " + ОписаниеОшибки());	
		Возврат Ложь;      
		
	КонецПопытки;   
	
	Если НЕ ЗначениеЗаполнено(ТекущийСотрудник) Тогда
		Сообщить("Пользователь ИБ не связан с активным сотрудником.");	
		Возврат Ложь;
	КонецЕсли;

  	Попытка
    	Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	УведомленияПользователей.Период КАК Период,
			|	УведомленияПользователей.Получатель КАК Получатель,
			|	УведомленияПользователей.Заявка КАК Заявка,
			|	УведомленияПользователей.ТипУведомления КАК ТипУведомления
			|ИЗ
			|	РегистрСведений.УведомленияПользователей КАК УведомленияПользователей
			|ГДЕ
			|	УведомленияПользователей.Получатель = &Получатель
			|	И УведомленияПользователей.Заявка = &Заявка
			|	И УведомленияПользователей.Прочитано = ЛОЖЬ";
		
		Запрос.УстановитьПараметр("Заявка", Заявка);
		Запрос.УстановитьПараметр("Получатель", ТекущийСотрудник);
		
		ТаблицаУведомлений = Запрос.Выполнить().Выгрузить();
   
	Исключение 
		Сообщить("Не удалось получить уведомления по заявке. " + ОписаниеОшибки());		
		Возврат Ложь;
   
    КонецПопытки;
		
	Если ТаблицаУведомлений.Количество() = 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	МоментПрочтения = ТекущаяДатаСеанса(); 
	
	НачатьТранзакцию();
	
	Попытка
	   Для каждого Уведомление Из ТаблицаУведомлений Цикл
		ЗаписьУведомления = РегистрыСведений.УведомленияПользователей.СоздатьМенеджерЗаписи();
			ЗаписьУведомления.Период = Уведомление.Период;
			ЗаписьУведомления.Получатель = Уведомление.Получатель;
			ЗаписьУведомления.Заявка = Уведомление.Заявка;
			ЗаписьУведомления.ТипУведомления = Уведомление.ТипУведомления;
			
			ЗаписьУведомления.Прочитать();
			Если ЗаписьУведомления.Выбран() И НЕ ЗаписьУведомления.Прочитано Тогда		
		    	ЗаписьУведомления.Прочитано = Истина;
				ЗаписьУведомления.ДатаПрочтения = МоментПрочтения;

				ЗаписьУведомления.Записать();

			КонецЕсли;
		КонецЦикла; 
			
	    ЗафиксироватьТранзакцию(); 
		
	Исключение
		ОтменитьТранзакцию();	
		Сообщить("Не удалось отметить уведомления прочитанными. " + ОписаниеОшибки());		
		Возврат Ложь;
	КонецПопытки; 
	
	Возврат Истина;
КонецФункции
